made some modification to readme.md
